// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.



// int Number(int num)
// {
//     int des = num % 100;
//     int ed = des / 10;
// return ed;
// }


// Console.WriteLine("Input three - digit");
// int threeDigit = Convert.ToInt32(Console.ReadLine());
// int answer = Number(threeDigit);
// Console.WriteLine(answer);