//   Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Input two numbers: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int b = Convert.ToInt32(Console.ReadLine());
// if( a > b )
// {
//     Console.Write($" number {a} is bigger than number {b}" );

// }
// else
// {
//     Console.Write($" number {b} is bigger than number {a} ");
// }





// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.WriteLine("input three nubers: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int b = Convert.ToInt32(Console.ReadLine());
// int c = Convert.ToInt32(Console.ReadLine());
// int max;
// if(a > b)
// {
//      max = a;
// }
// else 
// {
//     max = b;
// }

// if(max > c)
// {
// Console.Write($"The biggest number is {max}");
// }
// else
// {
// Console.Write($"The biggest numbers is {c} ");
// }



// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Input a number: ");
// int a = Convert.ToInt32(Console.ReadLine());

// if( a % 2 == 1)
// {
//     Console.Write($"{a} is an odd integer ");
// }
// else
// {
//     Console.Write($"{a} is an even integer ");
// }



