//   Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Input two numbers: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int b = Convert.ToInt32(Console.ReadLine());
// if( a > b )
// {
//     Console.Write($" number {a} is bigger than number {b}" );

// }
// else
// {
//     Console.Write($" number {b} is bigger than number {a} ");
// }


// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

